bench/out/pessimistic-lock.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/hold-contention.js
        output: -

     scenarios: (100.00%) 2 scenarios, 150 max VUs, 1m5s max duration (incl. graceful stop):
              * single_seat: 1 iterations for each of 100 VUs (maxDuration: 30s, exec: singleSeat, gracefulStop: 30s)
              * spread: 50 looping VUs for 20s (exec: spread, startTime: 15s, gracefulStop: 30s)


running (0m01.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  14.0s     

running (0m02.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  13.0s     

running (0m03.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  12.0s     

running (0m04.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  11.0s     

running (0m05.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  10.0s     

running (0m06.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  09.0s     

running (0m07.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  08.0s     

running (0m08.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  07.0s     

running (0m09.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  06.0s     

running (0m10.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  05.0s     

running (0m11.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  04.0s     

running (0m12.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  03.0s     

running (0m13.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  02.0s     

running (0m14.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  01.0s     

running (0m15.0s), 000/150 VUs, 100 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      • [   0% ] waiting  00.0s     

running (0m16.0s), 050/150 VUs, 807 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [   5% ] 50 VUs   01.0s/20s 

running (0m17.0s), 050/150 VUs, 1765 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  10% ] 50 VUs   02.0s/20s 

running (0m18.0s), 050/150 VUs, 2450 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  15% ] 50 VUs   03.0s/20s 

running (0m19.0s), 050/150 VUs, 3180 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  20% ] 50 VUs   04.0s/20s 

running (0m20.0s), 050/150 VUs, 3641 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  25% ] 50 VUs   05.0s/20s 

running (0m21.0s), 050/150 VUs, 3953 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  30% ] 50 VUs   06.0s/20s 

running (0m22.0s), 050/150 VUs, 4762 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  35% ] 50 VUs   07.0s/20s 

running (0m23.0s), 050/150 VUs, 5998 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  40% ] 50 VUs   08.0s/20s 

running (0m24.0s), 050/150 VUs, 7438 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  45% ] 50 VUs   09.0s/20s 

running (0m25.0s), 050/150 VUs, 9276 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  50% ] 50 VUs   10.0s/20s 

running (0m26.0s), 050/150 VUs, 10987 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  55% ] 50 VUs   11.0s/20s 

running (0m27.0s), 050/150 VUs, 12873 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  60% ] 50 VUs   12.0s/20s 

running (0m28.0s), 050/150 VUs, 14670 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  65% ] 50 VUs   13.0s/20s 

running (0m29.0s), 050/150 VUs, 16679 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  70% ] 50 VUs   14.0s/20s 

running (0m30.0s), 050/150 VUs, 18674 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  75% ] 50 VUs   15.0s/20s 

running (0m31.0s), 050/150 VUs, 20677 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  80% ] 50 VUs   16.0s/20s 

running (0m32.0s), 050/150 VUs, 22698 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  85% ] 50 VUs   17.0s/20s 

running (0m33.0s), 050/150 VUs, 24791 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  90% ] 50 VUs   18.0s/20s 

running (0m34.0s), 050/150 VUs, 26681 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [  95% ] 50 VUs   19.0s/20s 

running (0m35.0s), 050/150 VUs, 28739 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread        [ 100% ] 50 VUs   20.0s/20s 


  █ TOTAL RESULTS 

    CUSTOM
    hold_conflict..................: 13294  379.609959/s
    hold_win.......................: 15543  443.830119/s
    single_seat_latency............: avg=150.34ms med=151.9ms p(95)=217.7ms p(99)=223.9ms  max=225.41ms
    spread_latency.................: avg=23.43ms  med=17.65ms p(95)=52.2ms  p(99)=91ms     max=929.08ms

    HTTP
    http_req_duration..............: avg=22.79ms  med=16.99ms p(95)=51.43ms p(99)=98.35ms  max=929.08ms
      { expected_response:true }...: avg=22.88ms  med=17.3ms  p(95)=51.51ms p(99)=89.55ms  max=929.08ms
    http_req_failed................: 29.95% 13294 out of 44379
    http_reqs......................: 44379  1267.241642/s

    EXECUTION
    iteration_duration.............: avg=35.22ms  med=30.72ms p(95)=85.06ms p(99)=156.66ms max=971.98ms
    iterations.....................: 28837  823.440078/s
    vus............................: 50     min=0              max=50 
    vus_max........................: 150    min=150            max=150

    NETWORK
    data_received..................: 18 MB  511 kB/s
    data_sent......................: 14 MB  390 kB/s



running (0m35.0s), 000/150 VUs, 28837 complete and 0 interrupted iterations
single_seat ✓ [ 100% ] 100 VUs  00.2s/30s  100/100 iters, 1 per VU
spread      ✓ [ 100% ] 50 VUs   20s